{
  "news": [
    {
      "id": 1,
      "title": "Welcome to BuildnChill - Season 3 Launch!",
      "content": "We're excited to announce the launch of Season 3! Join us for an amazing adventure with new features, plugins, and an incredible community. This season brings fresh challenges, updated economy, and tons of fun activities for everyone.",
      "image": "https://images.unsplash.com/photo-1606503153255-59d8b8b396e0?w=800",
      "date": "2024-01-15",
      "description": "Season 3 is here with exciting new features and updates!"
    },
    {
      "id": 2,
      "title": "New PvP Arena Opening This Weekend",
      "content": "Get ready for epic battles! Our brand new PvP arena opens this weekend with tournaments, ranked matches, and amazing rewards. Test your skills against other players and climb the leaderboards.",
      "image": "https://images.unsplash.com/photo-1606503153255-59d8b8b396e0?w=800",
      "date": "2024-01-10",
      "description": "Compete in our new PvP arena with tournaments and ranked matches."
    },
    {
      "id": 3,
      "title": "Community Build Contest - Win Amazing Prizes!",
      "content": "Show off your building skills! Enter our monthly build contest and compete for amazing prizes including in-game currency, special ranks, and exclusive items. The theme for this month is 'Medieval Castles'.",
      "image": "https://images.unsplash.com/photo-1606503153255-59d8b8b396e0?w=800",
      "date": "2024-01-05",
      "description": "Enter our monthly build contest with the theme 'Medieval Castles'."
    },
    {
      "id": 4,
      "title": "Server Maintenance Complete - Performance Improvements",
      "content": "We've completed our latest server maintenance with significant performance improvements. Expect smoother gameplay, reduced lag, and better overall experience. Thank you for your patience!",
      "image": "https://images.unsplash.com/photo-1606503153255-59d8b8b396e0?w=800",
      "date": "2024-01-01",
      "description": "Server performance has been significantly improved after maintenance."
    },
    {
      "id": 5,
      "title": "New Plugin: Economy System Update",
      "content": "Our economy system has been completely revamped! New shops, better trading, and more ways to earn money. Check out the new features and start building your fortune today.",
      "image": "https://images.unsplash.com/photo-1606503153255-59d8b8b396e0?w=800",
      "date": "2023-12-28",
      "description": "Revamped economy system with new shops and trading features."
    },
    {
      "id": 6,
      "title": "Holiday Event - Special Rewards Available",
      "content": "Celebrate the holidays with us! Special events, limited-time rewards, and festive decorations throughout the server. Don't miss out on exclusive holiday items and experiences.",
      "image": "https://images.unsplash.com/photo-1606503153255-59d8b8b396e0?w=800",
      "date": "2023-12-20",
      "description": "Join our holiday event for special rewards and festive activities."
    },
    {
      "id": 7,
      "title": "Discord Server Integration - New Features",
      "content": "Our Discord server now has better integration with the game! Link your accounts, receive in-game notifications, and participate in Discord-exclusive events. Join our community today!",
      "image": "https://images.unsplash.com/photo-1606503153255-59d8b8b396e0?w=800",
      "date": "2023-12-15",
      "description": "Enhanced Discord integration with new features and notifications."
    },
    {
      "id": 8,
      "title": "Staff Applications Now Open",
      "content": "We're looking for dedicated players to join our staff team! If you're interested in helping the community, moderating, and being part of the team, apply now. We're looking for responsible and active members.",
      "image": "https://images.unsplash.com/photo-1606503153255-59d8b8b396e0?w=800",
      "date": "2023-12-10",
      "description": "Join our staff team - applications are now open for dedicated players."
    },
    {
      "id": 9,
      "title": "New Survival World - Fresh Start for Everyone",
      "content": "A brand new survival world has been created! Start fresh, explore new biomes, and build your dream base. All players start on equal footing in this new world.",
      "image": "https://images.unsplash.com/photo-1606503153255-59d8b8b396e0?w=800",
      "date": "2023-12-05",
      "description": "Fresh survival world with new biomes and equal starting conditions."
    },
    {
      "id": 10,
      "title": "Weekly Events Schedule Released",
      "content": "Check out our weekly events schedule! From build competitions to treasure hunts, there's something for everyone. Events run every day with rotating activities.",
      "image": "https://images.unsplash.com/photo-1606503153255-59d8b8b396e0?w=800",
      "date": "2023-11-30",
      "description": "Weekly events schedule with daily rotating activities for all players."
    }
  ],
  "serverStatus": {
    "status": "Online",
    "players": "127",
    "maxPlayers": "500",
    "version": "1.20.4",
    "uptime": "99.9%"
  }
}

